# 使用的编译器
CC=g++
# 选项
CFLAGS=-Wall
# 需要链接的动态库
LIBS=-lhiredis
# 最终目标
app=app
target=$(app)		
ALL:$(target)
#######################################################################
#                        测试程序相关的规则
# 生成每一个子目标,
# main程序
$(app):HiredisApi.o main.o
	$(CC) $^ $(LIBS) -o $@ -g

#######################################################################
#                         所有程序都需要的规则
# 生成所有的.o 文件
%.o:%.cpp
	$(CC) -c $< -o $@ $(CFLAGS)

# 项目清除
clean:
	-rm -rf *.o $(target)

# 声明伪文件
.PHONY:clean ALL
#######################################################################
